/**
 *******************************************************************************
 * @file    iio-device.h
 * @brief   简要描述
 *******************************************************************************
 * @attention
 *
 * none
 *
 *******************************************************************************
 * @note
 *
 * none
 *
 *******************************************************************************
 * @author  MekLi
 * @date    2026/2/10
 * @version 1.0
 *******************************************************************************
 */


/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef INFANTRY_CHASSIS_IIO_DEVICE_H
#define INFANTRY_CHASSIS_IIO_DEVICE_H



/*-------- 1. includes and imports -----------------------------------------------------------------------------------*/

#include "iio-type.h"



/*-------- 2. enum and define ----------------------------------------------------------------------------------------*/




/*-------- 3. interface ----------------------------------------------------------------------------------------------*/

class IIODevice {
public:
    virtual ~IIODevice() = default;

    /**
     * @brief 核心读取接口
     * @param type    物理量类型 (如 ACCEL)
     * @param chan    通道 (如 Z)
     * @param out_val 输出值 (必须是 SI 单位)
     * @return true 读取成功, false 设备不支持该通道
     */
    virtual bool ReadChannel(IIOType type, IIOChan chan, float& out_val) = 0;

    /**
     * @brief 获取设备名称 (用于调试或注册表查找)
     */
    const char* GetName() const { return m_name; }

protected:
    const char* m_name = "unknown";
};



/*-------- 4. decorator ----------------------------------------------------------------------------------------------*/




/*-------- 5. factories ----------------------------------------------------------------------------------------------*/





#endif /*INFANTRY_CHASSIS_IIO_DEVICE_H*/
